org/lrn/lisp/lisp-2.org
#+STARTUP: showall indent hidestars

* План работ

На этом этапе мы добавим к динамическому окружению глобальное и разделим MYEVAL на
MYEVAL и MYAPPLY.

Кроме того мы отделим классы ошибок от всего остального кода

* Глобальное окружение

Создадим переменную, которая будет хранить глобальное окружение. Нам понадобится
~lookup~. Это функция, которая возвращает значение переменной, переданной ей.

#+NAME: lookup_2
#+BEGIN_SRC lisp
  (defparameter *glob-env* nil)

  (defun lookup (symb env)
    (let ((it (assoc symb env)))
      (if (not (null it))
          it
          (assoc symb *glob-env*))))
#+END_SRC

* MyApply

Мы вынесем в APPLY все функции и вычисление значений символов, а также lambda.

#+NAME: myapply_2
#+BEGIN_SRC lisp
  (defun myapply (fn args env)
    (cond
      <<myapply_ariph_2>>
      <<myapply_car_cdr_cons_2>>
      <<myapply_null_2>>
      <<myapply_func_symb_2>>
      <<myapply_lambda_2>>
      ))
#+END_SRC

И отдельно вынесем тесты:

#+NAME: myapply_2_test
#+BEGIN_SRC lisp
  <<myapply_ariph_2_test>>
  <<myapply_car_cdr_cons_2_test>>
  <<myapply_null_2_test>>
  <<myapply_func_symb_2_test>>
  <<myapply_lambda_2_test>>
#+END_SRC

В подразделах находятся функции для MYAPPLY, в них сделаны косметические изменения,
чтобы соответствовать именам параметров в месте, где они будут вызываны. Тесты остаются
без изменений.

Добавлено вычисление символов-функций, так, чтобы использовать ~lookup~ в глобальном
окружении.

** Встроенные функции арифметики

#+NAME: myapply_ariph_2
#+BEGIN_SRC lisp
  ((equal fn '+)               (+ (car args) (cadr args)))
  ((equal fn '*)               (* (car args) (cadr args)))
#+END_SRC

#+NAME: myapply_ariph_2_test
#+BEGIN_SRC lisp
  (assert (equal 7 (myeval 7 nil)))
  (assert (equal 3 (myeval '(+ 1 2) nil)))
  (assert (equal 21 (myeval '(* (+ 1 2) (+ 3 4)) nil)))
  (assert (equal 2 (myeval 'a '((a . 2)))))
  (assert (equal 47 (myeval '(+ a b) '((a . 45) (b . 2)))))
#+END_SRC

** Работа с CONS-ячейками

#+NAME: myapply_car_cdr_cons_2
#+BEGIN_SRC lisp
  ((equal fn 'car)             (caar args))
  ((equal fn 'cdr)             (cdar args))
  ((equal fn 'cons)            (cons (car args) (cadr args)))
#+END_SRC

#+NAME: myapply_car_cdr_cons_2_test
#+BEGIN_SRC lisp
  (assert (equal '(1 . 2) (myeval '(cons 1 2) nil)))
  (assert (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
  (assert (equal 2 (myeval '(car (cons 2 3)) nil)))
  (assert (equal 3 (myeval '(cdr (cons 2 3)) nil)))
  (assert (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
  (assert (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
  (assert (equal 1 (myeval '(car a) '((a . (1 . 2))))))
  (assert (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
  (assert (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
#+END_SRC

** NULL-предикат

#+NAME: myapply_null_2
#+BEGIN_SRC lisp
  ((equal fn 'null)            (null (car args)))
#+END_SRC

Добавляем тесты, проверящие символ в окружении, равный nil и не nil

#+NAME: myapply_null_2_test
#+BEGIN_SRC lisp
  (assert (equal T (myeval '(null ()) nil)))
  (assert (equal T (myeval '(null a) '((a . ())))))
  (assert (equal NIL (myeval '(null a) '((a . 1)))))
#+END_SRC

** Вычисление символов-функций

Добавим ошибку, если функция не найдена в окружении

#+NAME: errors_2
#+BEGIN_SRC lisp
  (define-condition function-not-found-error (error)
    ((fn :initarg :fn  :reader fn))
    (:report
     (lambda (condition stream)
       (format stream "Error in MYAPPLY: function not found: ~A"
               (fn condition)))))

#+END_SRC

И будем сигнализировать ее в этой ситуации

#+NAME: myapply_func_symb_2
#+BEGIN_SRC lisp
  ((symbolp fn)                (let ((it (lookup fn env)))
                                 (if (null it)
                                     (error 'function-not-found-error :fn fn)
                                     (myapply (cdr it) args env))))
#+END_SRC

#+NAME: myapply_func_symb_2_test
#+BEGIN_SRC lisp
  (assert (equal 49 (myeval '(alfa beta) '((alfa . (lambda (x) (* x x)))
                                           (beta . 7)))))
  ;; (assert (equal "error"
  ;;                (handler-case (myeval '(alfa beta) '((beta . 7)))
  ;;                  (FUNCTION-NOT-FOUND-ERROR (condition) "error"))))
#+END_SRC

** LAMBDA

#+NAME: myapply_lambda_2
#+BEGIN_SRC lisp
  ((equal (car fn) 'lambda)    (myeval (car (cddr fn))
                                       (pairlis (car (cdr fn))
                                                args
                                                env)))
#+END_SRC

#+NAME: myapply_lambda_2_test
#+BEGIN_SRC lisp
  (assert (equal '(42 . 42) (myeval '((lambda (x)
                                        (cons x x))
                                      42) nil)))
  (assert (equal '(42 . 17) (myeval '((lambda (x y)
                                        (cons x y))
                                      42 17) nil)))
#+END_SRC

