www/lrn/lisp/lisp-2.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">План работ</a></li>
<li><a href="#unnumbered-2">Глобальное окружение</a></li>
<li><a href="#unnumbered-3">MyApply</a>
<ul>
<li><a href="#unnumbered-4">Встроенные функции арифметики</a></li>
<li><a href="#unnumbered-5">Работа с CONS-ячейками</a></li>
<li><a href="#unnumbered-6">NULL-предикат</a></li>
<li><a href="#unnumbered-7">Вычисление символов-функций</a></li>
<li><a href="#unnumbered-8">LAMBDA</a></li>
</ul>
</li>
<li><a href="#unnumbered-9">MyEval</a>
<ul>
<li><a href="#unnumbered-10">Самовычисляемые формы</a></li>
<li><a href="#unnumbered-11">Вычисление символов</a></li>
<li><a href="#unnumbered-12">Цитирование</a></li>
<li><a href="#unnumbered-13">Условное выполнение IF</a></li>
<li><a href="#unnumbered-14">COND</a></li>
<li><a href="#unnumbered-15">LET</a></li>
<li><a href="#unnumbered-16">PROGN</a></li>
<li><a href="#unnumbered-17">PRINT</a></li>
<li><a href="#unnumbered-18">LIST</a></li>
<li><a href="#unnumbered-19">LET*</a></li>
<li><a href="#unnumbered-20">DEFUN</a></li>
<li><a href="#unnumbered-21">SETQ</a></li>
<li><a href="#unnumbered-22">LAMBDA</a></li>
</ul>
</li>
<li><a href="#unnumbered-23">Repl</a></li>
<li><a href="#unnumbered-24">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">План работ</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
На этом этапе мы добавим к динамическому окружению глобальное и разделим MYEVAL на
MYEVAL и MYAPPLY.
</p>

<p>
Кроме того мы отделим классы ошибок от всего остального кода
</p>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Глобальное окружение</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Создадим переменную, которая будет хранить глобальное окружение. Нам понадобится
<code>lookup</code>. Это функция, которая возвращает значение переменной, переданной ей.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_2">(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*glob-env*</span> nil)

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env)
  (<span style="color: #af00ff;">let</span> ((it (assoc symb env)))
    (<span style="color: #af00ff;">if</span> (not (null it))
        it
        (assoc symb *glob-env*))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">MyApply</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Мы вынесем в APPLY все функции и вычисление значений символов, а также lambda.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_2">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myapply</span> (fn args env)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myapply_ariph_2&gt;&gt;
    &lt;&lt;myapply_car_cdr_cons_2&gt;&gt;
    &lt;&lt;myapply_null_2&gt;&gt;
    &lt;&lt;myapply_func_symb_2&gt;&gt;
    &lt;&lt;myapply_lambda_2&gt;&gt;
    ))
</pre>
</div>

<p>
И отдельно вынесем тесты:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_2_test">&lt;&lt;myapply_ariph_2_test&gt;&gt;
&lt;&lt;myapply_car_cdr_cons_2_test&gt;&gt;
&lt;&lt;myapply_null_2_test&gt;&gt;
&lt;&lt;myapply_func_symb_2_test&gt;&gt;
&lt;&lt;myapply_lambda_2_test&gt;&gt;
</pre>
</div>

<p>
В подразделах находятся функции для MYAPPLY, в них сделаны косметические изменения,
чтобы соответствовать именам параметров в месте, где они будут вызываны. Тесты остаются
без изменений.
</p>

<p>
Добавлено вычисление символов-функций, так, чтобы использовать <code>lookup</code> в глобальном
окружении.
</p>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">Встроенные функции арифметики</h3>
<div class="outline-text-3" id="text-unnumbered-4">
<div class="org-src-container">

<pre class="src src-lisp" id="myapply_ariph_2">((equal fn '+)               (+ (car args) (cadr args)))
((equal fn '*)               (* (car args) (cadr args)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_ariph_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 7 (myeval 7 nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(+ 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 21 (myeval '(* (+ 1 2) (+ 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval 'a '((a . 2)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 47 (myeval '(+ a b) '((a . 45) (b . 2)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-5" class="outline-3">
<h3 id="unnumbered-5">Работа с CONS-ячейками</h3>
<div class="outline-text-3" id="text-unnumbered-5">
<div class="org-src-container">

<pre class="src src-lisp" id="myapply_car_cdr_cons_2">((equal fn 'car)             (caar args))
((equal fn 'cdr)             (cdar args))
((equal fn 'cons)            (cons (car args) (cadr args)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_car_cdr_cons_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(car a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(cdr a) '((a . (1 . 2))))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">NULL-предикат</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<div class="org-src-container">

<pre class="src src-lisp" id="myapply_null_2">((equal fn 'null)            (null (car args)))
</pre>
</div>

<p>
Добавляем тесты, проверящие символ в окружении, равный nil и не nil
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_null_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null ()) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null a) '((a . ())))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null a) '((a . 1)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-3">
<h3 id="unnumbered-7">Вычисление символов-функций</h3>
<div class="outline-text-3" id="text-unnumbered-7">
<p>
Добавим ошибку, если функция не найдена в окружении
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="errors_2">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">function-not-found-error</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((fn <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:fn</span>  <span style="color: #5f5f87;">:reader</span> fn))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYAPPLY: function not found: ~A"</span>
             (fn condition)))))
</pre>
</div>

<p>
И будем сигнализировать ее в этой ситуации
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_func_symb_2">((symbolp fn)                (<span style="color: #af00ff;">let</span> ((it (lookup fn env)))
                               (<span style="color: #af00ff;">if</span> (null it)
                                   (<span style="color: #ff0000; font-weight: bold;">error</span> 'function-not-found-error <span style="color: #5f5f87;">:fn</span> fn)
                                   (myapply (cdr it) args env))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_func_symb_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 49 (myeval '(alfa beta) '((alfa . (<span style="color: #af00ff;">lambda</span> (x) (* x x)))
                                         (beta . 7)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal "error"</span>
<span style="color: #af0000;">;;                </span><span style="color: #af0000;">(handler-case (myeval '(alfa beta) '((beta . 7)))</span>
<span style="color: #af0000;">;;                  </span><span style="color: #af0000;">(FUNCTION-NOT-FOUND-ERROR (condition) "error"))))</span>
</pre>
</div>
</div>
</div>
