www/lrn/lisp/lisp-2.html

<div id="outline-container-unnumbered-8" class="outline-3">
<h3 id="unnumbered-8">LAMBDA</h3>
<div class="outline-text-3" id="text-unnumbered-8">
<div class="org-src-container">

<pre class="src src-lisp" id="myapply_lambda_2">((equal (car fn) 'lambda)    (myeval (car (cddr fn))
                                     (pairlis (car (cdr fn))
                                              args
                                              env)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_lambda_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 42) (myeval '((<span style="color: #af00ff;">lambda</span> (x)
                                      (cons x x))
                                    42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(42 . 17) (myeval '((<span style="color: #af00ff;">lambda</span> (x y)
                                      (cons x y))
                                    42 17) nil)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-9" class="outline-2">
<h2 id="unnumbered-9">MyEval</h2>
<div class="outline-text-2" id="text-unnumbered-9">
<p>
Большинство компонентов <code>myeval</code> остаются без изменений. Но, теперь, имея глобальное
окружение мы можем определить <code>defun</code> и <code>setq</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_2">&lt;&lt;myeval_evcond_2&gt;&gt;
&lt;&lt;myeval_evprogn_2&gt;&gt;
&lt;&lt;myeval_evlis_2&gt;&gt;
&lt;&lt;myeval_mypairlis_2&gt;&gt;
&lt;&lt;myeval_evletstar_2&gt;&gt;

(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (lst env)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myeval_number_2&gt;&gt;
    &lt;&lt;myeval_symb_2&gt;&gt;
    &lt;&lt;myeval_quote_2&gt;&gt;
    &lt;&lt;myeval_if_2&gt;&gt;
    &lt;&lt;myeval_cond_2&gt;&gt;
    &lt;&lt;myeval_let_2&gt;&gt;
    &lt;&lt;myeval_progn_2&gt;&gt;
    &lt;&lt;myeval_print_2&gt;&gt;
    &lt;&lt;myeval_list_2&gt;&gt;
    &lt;&lt;myeval_letstar_2&gt;&gt;
    &lt;&lt;myeval_defun_2&gt;&gt;
    &lt;&lt;myeval_setq_2&gt;&gt;
    &lt;&lt;myeval_lambda_2&gt;&gt;
    (t
     (myapply (myeval (car lst) env)
              (evlis (cdr lst) env)
              env))))
</pre>
</div>

<p>
Также определим тесты
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_2_test">&lt;&lt;myeval_number_2_test&gt;&gt;
&lt;&lt;myeval_symb_2_test&gt;&gt;
&lt;&lt;myeval_quote_2_test&gt;&gt;
&lt;&lt;myeval_if_2_test&gt;&gt;
&lt;&lt;myeval_cond_2_test&gt;&gt;
&lt;&lt;myeval_let_2_test&gt;&gt;
&lt;&lt;myeval_progn_2_test&gt;&gt;
&lt;&lt;myeval_list_2_test&gt;&gt;
&lt;&lt;myeval_letstar_2_test&gt;&gt;
&lt;&lt;myeval_defun_2_test&gt;&gt;
&lt;&lt;myeval_setq_2_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">Самовычисляемые формы</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<p>
Добавляем в самовычисляемые формы <code>car</code> <code>cdr</code> <code>cons</code> и <code>null</code>, потому что ниже мы
добавим рекурсивное вычисление форм в конец <code>cond</code> в <code>myeval</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_2">((null lst)                  nil)
((equal t lst)               t)
((member lst '(+ * car cdr cons null))  lst)
((numberp lst)               lst)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval 'T nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval 'NIL nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 999 (myeval 999 nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-3">
<h3 id="unnumbered-11">Вычисление символов</h3>
<div class="outline-text-3" id="text-unnumbered-11">
<p>
Добавим ошибку, если функция не найдена в окружении
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="errors_2">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">variable-not-found-error</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((variable <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:variable</span>  <span style="color: #5f5f87;">:reader</span> variable))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYEVAL: variable not found: ~A"</span>
             (variable condition)))))
</pre>
</div>

<p>
Теперь  мы вычисляем значение символа обращаясь к <code>lookup</code> и сигнализируем ошибку, если
не смогли найти символ даже в глобальном окружении.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_symb_2">((symbolp lst)               (<span style="color: #af00ff;">let</span> ((it (lookup lst env)))
                               (<span style="color: #af00ff;">if</span> (null it)
                                   (<span style="color: #ff0000; font-weight: bold;">error</span> 'variable-not-found-error <span style="color: #5f5f87;">:variable</span> lst)
                                   (cdr it))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_symb_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6 (myeval 'b '((a . 3) (b . 6)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (myeval 'b nil)
                 (VARIABLE-NOT-FOUND-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-12" class="outline-3">
<h3 id="unnumbered-12">Цитирование</h3>
<div class="outline-text-3" id="text-unnumbered-12">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_quote_2">((equal (car lst) 'quote)    (cadr lst))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_quote_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-13" class="outline-3">
<h3 id="unnumbered-13">Условное выполнение IF</h3>
<div class="outline-text-3" id="text-unnumbered-13">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_if_2">((equal (car lst) 'if)       (<span style="color: #af00ff;">if</span> (myeval (cadr lst) env)
                                 (myeval (caddr lst) env)
                                 (myeval (cadddr lst) env)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_if_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> () 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> (null ()) 1 2) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . ())))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . 1)))))
</pre>
</div>
</div>
</div>
