www/lrn/lisp/lisp-2.html

<div id="outline-container-unnumbered-14" class="outline-3">
<h3 id="unnumbered-14">COND</h3>
<div class="outline-text-3" id="text-unnumbered-14">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evcond_2">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)               nil)
        ((myeval (caar lst) env)  (myeval (cadar lst) env))
        (t                        (evcond (cdr lst) env))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_cond_2">((equal (car lst) 'cond)     (evcond (cdr lst) env))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_cond_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (() 1)
                           (1 2))
                         nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                         (a 1)
                         (b 2))
                       '((a . ()) (b . 1)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ())))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-15" class="outline-3">
<h3 id="unnumbered-15">LET</h3>
<div class="outline-text-3" id="text-unnumbered-15">
<p>
Вынесем <code>mypairlis-error</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="errors_2">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">mypairlis-error</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((lst1 <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:lst1</span>  <span style="color: #5f5f87;">:reader</span> lst1)
   (lst2 <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:lst2</span>  <span style="color: #5f5f87;">:reader</span> lst2))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYPAIRLIS: wrong params:~%'~A~%'~A"</span>
             (lst1 condition) (lst2 condition)))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-lisp" id="myeval_mypairlis_2">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mypairlis</span> (lst1 lst2 alist)
  (<span style="color: #af00ff;">cond</span> ((and (null lst1) (null lst2))  alist)
        ((or  (null lst1) (null lst2))  (<span style="color: #ff0000; font-weight: bold;">error</span> 'mypairlis-error <span style="color: #5f5f87;">:lst1</span> lst1 <span style="color: #5f5f87;">:lst2</span> lst2))
        (t                              (cons (cons (car lst1)
                                                    (car lst2))
                                              (mypairlis (cdr lst1)
                                                         (cdr lst2)
                                                         alist)))))
</pre>
</div>

<p>
Добавим тесты, которые проверяют возникновение ошибок, когда мы пытаемся обратиться к
переменной, которой нет в окружении.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_mypairlis_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(( a . 1) (b . 2) ( c . 3) (z . 6) (y . 77))
               (mypairlis '(a b c) '(1 2 3) '((z . 6) (y . 77)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (mypairlis '(a b c) nil '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (mypairlis nil '(1 2 3) '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-lisp" id="myeval_let_2">((equal (car lst) 'let)      (evprogn (cddr lst) <span style="color: #af0000;">; implicit progn</span>
                                      (pairlis (mapcar #'car (cadr lst))
                                               (evlis (mapcar #'cadr (cadr lst))
                                                      env)
                                               env)))
</pre>
</div>

<p>
и проверить его:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_let_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(<span style="color: #af00ff;">let</span> ((a 1)
                                       (b 2))
                                  (cons a b)) nil)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-16" class="outline-3">
<h3 id="unnumbered-16">PROGN</h3>
<div class="outline-text-3" id="text-unnumbered-16">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evprogn_2">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)        nil)
        ((null (cdr lst))  (myeval (car lst) env))
        (t                 (myeval (car lst) env)
                           (evprogn (cdr lst) env))))
</pre>
</div>

<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_progn_2">((equal (car lst) 'progn)    (evprogn (cdr lst) env))
</pre>
</div>

<p>
Добавляем тесты в окружении
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_progn_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> 1 2 3) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> a b c) '((a . 1) (b . 2) (c . 3)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-17" class="outline-3">
<h3 id="unnumbered-17">PRINT</h3>
<div class="outline-text-3" id="text-unnumbered-17">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_print_2">((equal (car lst) 'print)    (print (myeval (cadr lst)  env)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-18" class="outline-3">
<h3 id="unnumbered-18">LIST</h3>
<div class="outline-text-3" id="text-unnumbered-18">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evlis_2">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (lst env)
  (<span style="color: #af00ff;">cond</span> ((null lst)  nil)
        (t           (cons (myeval (car lst) env)
                     (evlis (cdr lst) env)))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evlis_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ 1 2) (* 2 3) 42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (evlis '((+ a b) (* b c) 42) '((a . 1) (b . 2) (c . 3) (d . 4)))))
</pre>
</div>

<p>
LIST определяем почти без изменений:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_list_2">((equal (car lst) 'list)     (evlis (cdr lst) env))
</pre>
</div>

<p>
Протестируем <code>list</code> (добавляя тесты в окружении)
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_list_2_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ 1 2) (* 2 3) 42) nil)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ a b) (* b c) 42)
                       '((a . 1) (b . 2) (c . 3) (d . 4)))))
</pre>
</div>
</div>
</div>
